In [2]:
import pandas as pd

df = pd.read_csv("data.csv")
df.head()
df.tail()

,OrderID,CustomerName,Product,Category,Quantity,Price,OrderDate,Shipped,Country
8,1009,Maria Rossi,Pen,Stationery,10,1.5,2024-06-10,Yes,Italy
9,1010,Takeshi Nakamura,Mouse,Electronics,1,35.0,2024-06-11,Yes,Japan
10,1011,Sophie Martin,Webcam,Electronics,1,85.0,2024-06-12,Yes,France
11,1012,Raj Patel,File Cabinet,Furniture,2,180.0,2024-06-13,No,India
12,1013,Emma Wilson,Stapler,Stationery,3,12.0,2024-06-14,Yes,Australia

In [10]:
# Extracting Columns

order_date = df["OrderDate"]
order_date

0     2024-06-01
1     2024-06-03
2     2024-06-04
3     2024-06-05
4     2024-06-06
5     2024-06-07
6     2024-06-08
7     2024-06-09
8     2024-06-10
9     2024-06-11
10    2024-06-12
11    2024-06-13
12    2024-06-14
Name: OrderDate, dtype: object

In [12]:
# Creating Manually & Custom Indexing 

s1 = pd.Series([10,20,30,40,50] , index=['a','b','c','d','e'])
s1

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [18]:
# Creating Series from Dictionary

data = {
    'math': 85,
    'science': 90,
    'english': 88
}

s4 = pd.Series(data)
s4

math       85
science    90
english    88
dtype: int64

In [17]:
data = {
    'name': ['Alice', 'Bob', 'Charlie'],
    'age': [24, 30, 28],
    'salary': [50000, 60000, 55000]
}

df1 = pd.DataFrame(data)
df1

      name  age  salary
0    Alice   24   50000
1      Bob   30   60000
2  Charlie   28   55000

In [31]:
df.dtypes

OrderID           int64
CustomerName     object
Product          object
Category         object
Quantity          int64
Price           float64
OrderDate        object
Shipped          object
Country          object
dtype: object

In [ ]:
df.isna().sum() ## To fill or drop ay data here use dropna() or fillna()

OrderID         0
CustomerName    0
Product         0
Category        0
Quantity        0
Price           0
OrderDate       0
Shipped         0
Country         0
dtype: int64

In [40]:
one = df.iloc[:5,:]
two = df.iloc[5:10,:]
two

,OrderID,CustomerName,Product,Category,Quantity,Price,OrderDate,Shipped,Country
5,1006,Nora Ibrahim,Notebook,Stationery,5,5.0,2024-06-07,Yes,UAE
6,1007,Emily Davis,Standing Desk,Furniture,1,450.0,2024-06-08,Yes,UK
7,1008,James Park,Monitor,Electronics,2,220.0,2024-06-09,No,South Korea
8,1009,Maria Rossi,Pen,Stationery,10,1.5,2024-06-10,Yes,Italy
9,1010,Takeshi Nakamura,Mouse,Electronics,1,35.0,2024-06-11,Yes,Japan

In [41]:
## Merging DataFrames 

df_users = pd.DataFrame({
    'user_id': [1, 2, 3],
    'name': ['Alice', 'Bob', 'Charlie']
})

df_orders = pd.DataFrame({
    'user_id': [1, 2, 4],
    'order_amount': [250, 450, 300]
})

new_df = pd.merge(df_users,df_orders,on='user_id')
new_df

   user_id   name  order_amount
0        1  Alice           250
1        2    Bob           450

In [44]:
df.groupby(df.columns[2]).size()
df

,OrderID,CustomerName,Product,Category,Quantity,Price,OrderDate,Shipped,Country
0,1001,John Smith,Laptop,Electronics,1,1200.0,2024-06-01,Yes,USA
1,1002,Sarah Lee,Headphones,Electronics,2,150.0,2024-06-03,No,Canada
2,1003,Ali Khan,Office Chair,Furniture,1,300.0,2024-06-04,Yes,UAE
3,1004,Alice Wong,Desk Lamp,Furniture,3,45.0,2024-06-05,Yes,Singapore
4,1005,Carlos Mendez,Keyboard,Electronics,2,80.0,2024-06-06,No,Mexico
5,1006,Nora Ibrahim,Notebook,Stationery,5,5.0,2024-06-07,Yes,UAE
6,1007,Emily Davis,Standing Desk,Furniture,1,450.0,2024-06-08,Yes,UK
7,1008,James Park,Monitor,Electronics,2,220.0,2024-06-09,No,South Korea
8,1009,Maria Rossi,Pen,Stationery,10,1.5,2024-06-10,Yes,Italy
9,1010,Takeshi Nakamura,Mouse,Electronics,1,35.0,2024-06-11,Yes,Japan
10,1011,Sophie Martin,Webcam,Electronics,1,85.0,2024-06-12,Yes,France
11,1012,Raj Patel,File Cabinet,Furniture,2,180.0,2024-06-13,No,India
12,1013,Emma Wilson,Stapler,Stationery,3,12.0,2024-06-14,Yes,Australia

In [47]:
df.groupby([df.columns[0], df.columns[2]]).size()

OrderID  Product
1001     Laptop           1
1002     Headphones       1
1003     Office Chair     1
1004     Desk Lamp        1
1005     Keyboard         1
1006     Notebook         1
1007     Standing Desk    1
1008     Monitor          1
1009     Pen              1
1010     Mouse            1
1011     Webcam           1
1012     File Cabinet     1
1013     Stapler          1
dtype: int64

In [55]:
pt = pd.pivot_table(
    df,
    values=df.columns[5],
    index=df.columns[0],
    aggfunc='sum'
)
pt

          Price
OrderID
1001     1200.0
1002      150.0
1003      300.0
1004       45.0
1005       80.0
1006        5.0
1007      450.0
1008      220.0
1009        1.5
1010       35.0
1011       85.0
1012      180.0
1013       12.0

In [56]:
import pandas as pd

data = {
    "department" : ["IT","IT","HR","HR"],
    "gender" : ["Male","Female","Male","Female"],
    "salary" : [50000,60000,40000,45000]
}

df = pd.DataFrame(data)

pd.pivot_table(
    df,
    values=df.columns[2],
    index=df.columns[0],
    aggfunc='mean'
)

             salary
department
HR          42500.0
IT          55000.0

In [62]:
pd.pivot_table(
    df,
    values=df.columns[2],
    index=df.columns[0],
    columns=df.columns[1],
    aggfunc='mean'
)

gender       Female     Male
department
HR          45000.0  40000.0
IT          60000.0  50000.0

In [ ]:
pd.crosstab(
    df[df.columns[0]],
    df[df.columns[2]],
    normalize='index'
)

salary      40000  45000  50000  60000
department
HR           0.25   0.25   0.00   0.00
IT           0.00   0.00   0.25   0.25